
$(function(){
    $("#lang").on("change", function(e) {      
            changelang()
    });
    const faobj = {
        states: {
            "ME":{
                    id:1,
                    name:"مین",
                    detail:"مین، شمال شرقی‌ترین ایالت ایالات متحده، به‌خاطر خط ساحلی صخره‌ای، تاریخ دریایی و مناطق طبیعی مانند جزایر گرانیتی و صنوبر پارک ملی آکادیا معروف است. گوزن‌ها در پارک ایالتی باکستر، محل کوه کاتاهدین، نقطه پایانی مسیر آپالاچیان، فراوان هستند. فانوس‌های دریایی مانند فانوس دریایی راه راه در وست کودی هد، در ساحل پراکنده‌اند، همچنین کلبه‌های خرچنگ و سواحل شنی",
                    abr:"ME"
                } ,
            "HI":{
                    id:2,
                    name:"هاوائی",
                    detail:"هاوایی ایالتی در غرب ایالات متحده است که حدود 2000 مایل از سرزمین اصلی ایالات متحده در اقیانوس آرام فاصله دارد. این تنها ایالت ایالات متحده خارج از آمریکای شمالی، تنها ایالت مجمع الجزایر و تنها ایالت در مناطق استوایی است.",
                    abr:"HI"
                },
            "AK":{
                    id:3,
                    name:"آلاسکا",
                    detail:"آلاسکا یک ایالت ایالات متحده در منتهی الیه شمال غربی آمریکای شمالی است. این منطقه نیمه ای از ایالات متحده است، از شرق با بریتیش کلمبیا و یوکان در کانادا همسایه است و با منطقه خودمختار چوکوتکا فدراسیون روسیه مرز دریایی غربی در تنگه برینگ دارد.",
                    abr:"AK" 
            },
            "FL":{
                id:4,
                name:"فلوریدا",
                detail:"فلوریدا جنوب شرقی ترین ایالت ایالات متحده است که در یک طرف اقیانوس اطلس و از طرف دیگر خلیج مکزیک قرار دارد. صدها مایل سواحل دارد. شهر میامی به‌خاطر تأثیرات فرهنگی آمریکای لاتین و صحنه‌های هنری قابل‌توجه، و همچنین زندگی شبانه‌اش، به‌ویژه در ساحل جنوبی لوکس، شناخته شده است. اورلاندو به خاطر پارک های موضوعی از جمله دنیای والت دیزنی مشهور است",
                abr:"FL"
            },
            "SC":{
                id:5,
                name:"کارولینای جنوبی",
                detail:"کارولینای جنوبی ایالتی در جنوب شرقی ایالات متحده است که به‌خاطر خط ساحلی سواحل نیمه گرمسیری و جزایر دریایی باتلاقی معروف است. ساحلی چارلستون شهری تاریخی است که با خانه‌های پاستلی رنگ، مزارع قدیمی جنوب و فورت سامتر مشخص شده است، جایی که تیرهای آغازین جنگ داخلی در آن شلیک شد. در شمال، گراند استرند، یک امتداد تقریباً 60 مایلی ساحلی است که به‌خاطر زمین‌های گلف و شهر تعطیلات Myrtle Beach معروف است.",
                abr:"SC"
            },
            "GA":{
                id:6,
                name:"جورجیا",
                detail:"جورجیا ایالتی در جنوب شرقی ایالات متحده است که زمین آن سواحل ساحلی، زمین های کشاورزی و کوه ها را در بر می گیرد. پایتخت آتلانتا، آکواریوم جورجیا و مکان تاریخی ملی مارتین لوتر کینگ جونیور است که به زندگی و زمانه رهبر آفریقایی-آمریکایی اختصاص دارد. شهر ساوانا به خاطر معماری قرن 18 و 19 و میادین عمومی سرسبز مشهور است. آگوستا میزبان مسابقات گلف مسترز است.",
                abr:"GA"
            },
            "AL":{
                id:7,
                name:"آلاباما",
                detail:"آلاباما ایالتی در جنوب شرقی ایالات متحده است که مکان‌های مهم جنبش حقوق مدنی آمریکا را در خود جای داده است. کلیسای باپتیست خیابان شانزدهم شهر بیرمنگام که اکنون به موزه تبدیل شده است، در دهه 1960 مقر اعتراضات بود. کلیسای مارتین لوتر کینگ جونیور و موزه Rosa Parks که به این فعال اختصاص داده شده است را می توان در پایتخت مونتگومری یافت.",
                abr:"AL"
            },
            "NC":{
                id:8,
                name:"کارولینای شمالی",
                detail:"کارولینای شمالی ایالتی در منطقه جنوب شرقی ایالات متحده است. این ایالت بیست و هشتمین ایالت بزرگ و نهمین ایالت پرجمعیت ایالات متحده است. از شمال با ویرجینیا، از شرق با اقیانوس اطلس، از جنوب با جورجیا و کارولینای جنوبی و از غرب با تنسی همسایه است.",
                abr:"AL"
            }
            ,
            "TN":{
                id:9,
                name:"تنسی",
                detail:"تنسی یک ایالت محصور در خشکی در جنوب ایالات متحده است. پایتخت آن، که در مرکز شهر نشویل قرار دارد، قلب صحنه موسیقی کانتری است، با گراند اول اوپری قدیمی، تالار مشاهیر و موزه موسیقی کانتری و مجموعه‌ای افسانه‌ای از هانکی‌تونک‌ها و سالن‌های رقص. ممفیس، در منتهی الیه جنوب غربی، خانه گریسلند الویس پریسلی، استودیو سان پیشگام راک اند رول و کلوپ های بلوز خیابان بیل است.",
                abr:"TN"
            }
            ,
            "RI":{
                id:10,
                name:"رود آیلند",
                detail:"رود آیلند، ایالتی در ایالات متحده در نیوانگلند، به‌خاطر سواحل شنی و شهرهای ساحلی استعماری شهرت دارد. این شهر خانه چندین شهر بزرگ از جمله نیوپورت است که به خاطر قایقرانی و عمارت‌های عصر طلایی مانند The Breakers مشهور است. پراویدنس، پایتخت آن، محل دانشگاه براون، پارک سبز راجر ویلیامز، پارک آبی محوطه‌سازی‌شده و ریور واک، با تأسیسات هنری مشهور WaterFire است.",
                abr:"TN"
            }
            ,
            "CT":{
                id:11,
                name:"کنتیکت",
                detail:"کانکتیکات یک ایالت ایالات متحده در جنوب نیوانگلند است که ترکیبی از شهرهای ساحلی و مناطق روستایی پر از شهرهای کوچک دارد. میستیک به‌خاطر موزه بندرگاه پر از کشتی‌های چند صد ساله، و نمایشگاه‌های نهنگ بلوگا در آکواریوم میستیک مشهور است. در لانگ آیلند ساند، شهر نیوهیون به عنوان خانه دانشگاه ییل و موزه تاریخ طبیعی پیبادی تحسین شده آن شناخته می شود.",
                abr:"CT"
            }
            ,
            "MA":{
                id:12,
                name:"ماساچوست",
                detail:"ماساچوست، با نام رسمی مشترک المنافع ماساچوست، پرجمعیت ترین ایالت در منطقه نیوانگلند در شمال شرقی ایالات متحده است که در سرشماری 2020 ایالات متحده بیش از 7 میلیون نفر جمعیت دارد که بالاترین تعداد ده ساله آن است.",
                abr:"MA"
            }
            ,
            "NH":{
                id:13,
                name:"نیوهمپشایر",
                detail:"نیوهمپشایر، یک ایالت ایالات متحده در نیوانگلند، با شهرهای عجیب و غریب و گستره وسیعی از بیابان تعریف شده است. در شمال، جنگل ملی کوه سفید به‌خاطر مناطق ورزش‌های زمستانی و کوه واشنگتن، مرتفع‌ترین قله منطقه، با راه‌آهن دنده‌ای تا قله آن، شهرت دارد. همچنین در کوه های سفید گوزن، خرس سیاه و بخشی از مسیر آپالاچیان وجود دارد",
                abr:"NH"
            }
            ,
            "VT":{
                id:14,
                name:"ورمونت",
                detail:"ورمونت ایالتی در شمال شرقی ایالات متحده است که به دلیل مناظر طبیعی خود که عمدتاً جنگلی است شناخته شده است. بخشی از منطقه نیوانگلند، همچنین به دلیل داشتن بیش از 100 پل چوبی سرپوشیده قرن نوزدهمی و به عنوان تولیدکننده عمده شربت افرا شناخته شده است. هزاران هکتار از زمین های کوهستانی توسط مسیرهای پیاده روی و پیست های اسکی عبور می کنند.",
                abr:"VT"
            }
            ,
            "NY":{
                id:15,
                name:"نیویورک",
                detail:"نیویورک ایالتی در شمال شرقی ایالات متحده است که به خاطر شهر نیویورک و آبشارهای بلند نیاگارا شهرت دارد. جزیره منهتن نیویورک دارای ساختمان امپایر استیت، میدان تایمز و پارک مرکزی است. پل بروکلین منهتن را به محله بروکلین متصل می کند. مجسمه نمادین آزادی در بندر نیویورک ایستاده است. در شرق، لانگ آیلند دارای سواحل، فانوس دریایی مونتاک، همپتونز و جزیره آتش است.",
                abr:"NY"
            }
            ,
            "NJ":{
                id:16,
                name:"نیو جرسی",
                detail:"نیوجرسی یکی از ایالت های شمال شرقی ایالات متحده با حدود 130 مایل ساحل اقیانوس اطلس است. جرسی سیتی، در آن سوی رودخانه هادسون از منهتن پایین، محل پارک ایالتی لیبرتی است، جایی که کشتی‌ها به مقصد جزیره الیس در نزدیکی آن، با موزه تاریخی مهاجرت، و مجسمه نمادین آزادی، حرکت می‌کنند. ساحل جرسی شامل شهرهای تفریحی قابل توجهی مانند پارک تاریخی آسبری و کیپ می، با ساختمان‌های ویکتوریایی حفاظت‌شده است.",
                abr:"NJ"
            }
            ,
            "PA":{
                id:17,
                name:"پنسیلوانیا",
                detail:"پنسیلوانیا، با نام رسمی مشترک المنافع پنسیلوانیا، ایالتی است که در مناطق اقیانوس اطلس میانه، شمال شرقی، آپالاش و دریاچه های بزرگ ایالات متحده قرار دارد.",
                abr:"PA"
            }
            ,
            "DE":{
                id:18,
                name:"دلاویر",
                detail:"دلاور، یک ایالت کوچک ایالات متحده در اقیانوس اطلس میانه، در شبه جزیره ای واقع شده است که با سواحل پشت شنی در مرز اقیانوس اطلس، رودخانه دلاور و خلیج دلاور مشخص شده است. در دوور، پایتخت، پارک «فرست ایالت هریتیج»، مکان‌های دیدنی دوران استعمار قرن هجدهم مانند خانه قدیمی ایالتی به سبک گرجستان را در بر می‌گیرد. شهر ویلمینگتون به‌خاطر ریورفرانت، ناحیه‌ای در کنار آب با پارک‌ها، بوتیک‌ها و رستوران‌ها معروف است..",
                abr:"DE"
            }
            ,
            "MD":{
                id:19,
                name:"مریلند",
                detail:"مریلند ایالتی در اقیانوس اطلس است که با آبراه ها و خطوط ساحلی فراوان در خلیج چساپیک و اقیانوس اطلس تعریف شده است. بزرگترین شهر آن، بالتیمور، تاریخ طولانی به عنوان یک بندر دریایی بزرگ دارد. فورت مک‌هنری، زادگاه سرود ملی ایالات متحده، در دهانه بندر داخلی بالتیمور، محل آکواریوم ملی و مرکز علمی مریلند قرار دارد.",
                abr:"MD"
            }
            ,
            "KY":{
                id:20,
                name:"کنتاکی",
                detail:"کنتاکی ایالتی در جنوب شرقی است که از شمال به رودخانه اوهایو و از شرق به کوه‌های آپالاچی محدود می‌شود و مرکز ایالت فرانکفورت است. بزرگترین شهر این ایالت، لوئیزویل، محل برگزاری دربی کنتاکی، مسابقه اسب‌سواری مشهوری است که در اولین شنبه ماه می در چرچیل داونز برگزار می‌شود. پیش از این مسابقه جشنواره ای 2 هفته ای برگزار می شود و در موزه دربی کنتاکی در تمام طول سال جشن گرفته می شود.",
                abr:"KY"
            }
            ,
            "OH":{
                id:21,
                name:"اوهایو",
                detail:"اوهایو ایالتی در غرب میانه ایالات متحده است. از بین پنجاه ایالت ایالات متحده، از نظر مساحت سی و چهارمین ایالت بزرگ است. اوهایو با جمعیتی نزدیک به 11.8 میلیون نفر، هفتمین ایالت پرجمعیت و دهمین ایالت پرجمعیت است.",
                abr:"OH"
            }
            ,
            "MI":{
                id:22,
                name:"میشیگان",
                detail:"میشیگان ایالتی در منطقه دریاچه های بزرگ در غرب میانه ایالات متحده است. از جنوب غربی با ویسکانسین، از جنوب با ایندیانا و اوهایو و از شمال و شمال شرق با استان انتاریو کانادا همسایه است.",
                abr:"MI"
            }
            ,
            "WY":{
                id:23,
                name:"وایومینگ",
                detail:"وایومینگ (به انگلیسی: Wyoming) ایالتی در منطقه کوهستانی غربی در غرب ایالات متحده است. از شمال و شمال غرب با مونتانا، از شرق با داکوتای جنوبی و نبراسکا، از غرب با آیداهو، از جنوب غربی با یوتا و از جنوب با کلرادو همسایه است.",
                abr:"WY"
            }
            ,
            "MT":{
                id:24,
                name:"مونتانا",
                detail:"مونتانا یک ایالت غربی است که با زمین های متنوع آن از کوه های راکی تا دشت های بزرگ تعریف شده است. فضاهای باز آن شامل پارک ملی Glacier، حفاظت‌شده در بیابان وسیعی است که به کانادا می‌رود. بسیاری از قله‌های پوشیده از برف، دریاچه‌ها و مسیرهای پیاده‌گردی آلپاین در امتداد جاده معروف Going-to-the-Sun که 50 مایل امتداد دارد به نمایش گذاشته شده است.",
                abr:"MT"
            }
            ,
            "ID":{
                id:25,
                name:"آیداهو",
                detail:"آیداهو ایالتی در شمال غربی ایالات متحده است که به‌خاطر مناظر کوهستانی، و مناطق وسیعی از مناطق وحشی حفاظت‌شده و مناطق تفریحی در فضای باز شهرت دارد. پایتخت، Boise، در دامنه کوه های راکی قرار دارد و توسط رودخانه Boise، که برای رفتینگ و ماهیگیری محبوب است، به دو نیم تقسیم شده است. پارک جولیا دیویس در کنار رودخانه شهر، فضای سبزی در مرکز شهر است که شامل باغ گل رز، موزه‌ها و باغ‌وحش است.",
                abr:"ID"
            }
            ,
            "WA":{
                id:26,
                name:"واشینگتن",
                detail:"واشنگتن با نام رسمی ایالت واشنگتن، ایالتی در منطقه شمال غربی اقیانوس آرام در غرب ایالات متحده است.",
                abr:"WA"
            }
            ,
            "TX":{
                id:27,
                name:"تگزاس",
                detail:"تگزاس ایالتی در جنوب مرکزی ایالات متحده آمریکا است. این ایالت با مساحت 268596 مایل مربع و با بیش از 30 میلیون نفر در سال 2022 دومین ایالت بزرگ ایالات متحده از نظر مساحت و جمعیت است.",
                abr:"TX"
            }
            ,
            "CA":{
                id:28,
                name:"کالیفرنیا",
                detail:"کالیفرنیا، ایالت غربی ایالات متحده، از مرز مکزیک در امتداد اقیانوس آرام به طول نزدیک به 900 مایل امتداد دارد. زمین آن شامل سواحل پر از صخره، جنگل قرمز، کوه‌های سیرا نوادا، زمین‌های کشاورزی دره مرکزی و صحرای موهاوه است. شهر لس آنجلس مقر صنعت سرگرمی هالیوود است. تپه سانفرانسیسکو به‌خاطر پل گلدن گیت، جزیره آلکاتراز و تله‌کابین معروف است",
                abr:"CA"
            }
            ,
            "AZ":{
                id:29,
                name:"آریزونا",
                detail:"آریزونا، ایالت جنوب غربی ایالات متحده، بیشتر به خاطر گراند کانیون، شکاف عمیقی که توسط رودخانه کلرادو حک شده است، شناخته شده است. فلگ استاف، یک شهر کوهستانی پوشیده از کاج پوندروسا، دروازه بزرگی به گرند کنیون است. سایر مکان‌های طبیعی عبارتند از پارک ملی ساگوارو، که از چشم‌انداز صحرای سونوران مملو از کاکتوس محافظت می‌کند. توسان قلمرو دانشگاه آریزونا و خانه موزه صحرای آریزونا-سونورا است.",
                abr:"AZ"
            }
            ,
            "NV":{
                id:30,
                name:"نوادا",
                detail:"نوادا ایالتی در منطقه غربی ایالات متحده است. از شمال غربی با اورگان، از شمال شرقی با آیداهو، از غرب با کالیفرنیا، از جنوب شرقی با آریزونا و از شرق با یوتا همسایه است. نوادا هفتمین وسیع ترین، سی و دومین ایالت پرجمعیت و نهمین ایالت کم تراکم در ایالات متحده است..",
                abr:"NV"
            }
            ,
            "UT":{
                id:31,
                name:"یوتا",
                detail:"یوتا یک ایالت محصور در خشکی در منطقه کوهستانی غرب غرب ایالات متحده است. از شرق با کلرادو، از شمال شرق با وایومینگ، از شمال با آیداهو، از جنوب با آریزونا و از غرب با نوادا همسایه است. یوتا همچنین گوشه ای از نیومکزیکو را در جنوب شرقی لمس می کند.",
                abr:"UT"
            }
            ,
            "CO":{
                id:32,
                name:"کلرادو",
                detail:"کلرادو، ایالت غربی ایالات متحده، دارای چشم اندازهای متنوعی از بیابان خشک، دره های رودخانه و کوه های راکی پوشیده از برف است که تا حدودی توسط پارک ملی کوه راکی محافظت می شود. در جای دیگر، پارک ملی Mesa Verde دارای خانه‌های صخره‌ای اجدادی Puebloan است. دنور، پایتخت و بزرگ‌ترین شهر کلرادو، یک مایل بالاتر از سطح دریا، دارای منطقه‌ای پر جنب و جوش در مرکز شهر است.",
                abr:"CO"
            }
            ,
            "OR":{
                id:33,
                name:"اورگن",
                detail:"اورگان ایالتی در منطقه شمال غربی اقیانوس آرام در ایالات متحده است. اورگان بخشی از غرب ایالات متحده است که رودخانه کلمبیا بخش زیادی از مرز شمالی اورگان را با واشنگتن ترسیم می کند، در حالی که رودخانه اسنیک قسمت زیادی از مرز شرقی خود را با آیدا مشخص می کند.",
                abr:"OR"
            }
            ,
            "ND":{
                id:34,
                name:"داکوتای شمالی",
                detail:"داکوتای شمالی یک ایالت غرب میانه ایالات متحده است که تحت تسلط دشت های بزرگ است. شهر شرقی آن، فارگو، هنر بومی آمریکا و هنر مدرن را در موزه هنر پلینز به نمایش می گذارد. تاریخ مهاجر این منطقه در انجمن میراث اسکاندیناوی در شهر مینوت گرامی داشته می شود. دشت های بزرگ جای خود را به بدلندهای ناهموار در نزدیکی مرز مونتانا می دهد، جایی که پارک ملی تئودور روزولت بر روی رودخانه میسوری کوچک قرار دارد.",
                abr:"ND"
            }
            ,
            "SD":{
                id:35,
                name:"داکوتای جنوبی",
                detail:"داکوتای جنوبی یک ایالت پهناور و کم جمعیت در غرب میانه ایالات متحده است که در آن دشت های غلتان جای خود را به جنگل ملی تپه های سیاه شگفت انگیز می دهند. بلک هیلز دارای ۲ بنای تاریخی است که درست در قله‌های گرانیتی حک شده‌اند: کوه راشمور، تصویر نمادین ۴ رئیس‌جمهور محترم ایالات متحده، و یادبود اسب دیوانه، ادای احترام به رهبر قبایل بومی آمریکایی.",
                abr:"SD"
            }
            ,
            "NE":{
                id:36,
                name:"نبراسکا",
                detail:"نبراسکا ایالتی در غرب میانه ایالات متحده است که شامل دشت‌های بزرگ، تپه‌های شنی بلند Sandhills و صخره‌های چشمگیر پانهندل است. لینکلن، پایتخت و یک شهر دانشگاهی پرجنب‌وجوش، با مرکز سر به فلک کشیده ایالتش متمایز است. شهر اوماها خانه موزه دورهام است که به گذشته پیشگام این ایالت در یک انبار راه آهن تغییر کاربری داده شده است. ",
                abr:"NE"
            }
            ,
            "IA":{
                id:37,
                name:"آیووا",
                detail:"آیووا، یک ایالت غرب میانه ایالات متحده، بین رودخانه های میسوری و می سی سی پی قرار دارد. این شهر به خاطر چشم انداز دشت های چرخان و مزارع ذرت شناخته شده است. دیدنی‌های پایتخت، د موین، شامل ساختمان کنگره ایالتی قرن نوزدهمی با گنبد طلا، پارک مجسمه‌سازی پاپاژون و مرکز هنری د موین است که به‌خاطر مجموعه‌های معاصرش مشهور است. موزه هنر شهر سدار رپیدز دارای نقاشی هایی از بومی آیوان گرانت وود است.",
                abr:"VT"
            }
            ,
            "MS":{
                id:38,
                name:"میسیسیپی",
                detail:"می سی سی پی ایالت جنوبی ایالات متحده با رودخانه می سی سی پی در غرب، ایالت آلاباما در شرق و خلیج مکزیک در جنوب است. منطقه دلتای می سی سی پی آن زادگاه موسیقی بلوز محسوب می شود که در موزه دلتا بلوز در کلارکزدیل مورد تقدیر قرار گرفته است. همچنین در این منطقه پارک ملی نظامی ویکسبورگ قرار دارد که محل نبرد حیاتی جنگ داخلی را حفظ کرده است",
                abr:"MS"
            }
            ,
            "IN":{
                id:39,
                name:"ایندیانا",
                detail:"ایندیانا یک ایالت ایالات متحده در غرب میانه ایالات متحده است. این ایالت سی و هشتمین از نظر مساحت و هفدهمین پرجمعیت ترین ایالت از 50 ایالت است. پایتخت و بزرگترین شهر آن ایندیاناپولیس است. ایندیانا در دسامبر به عنوان نوزدهمین ایالت در ایالات متحده پذیرفته شد ",
                abr:"IN"
            }
            ,
            "IL":{
                id:40,
                name:"ایلینوی",
                detail:"لینویز ایالتی در غرب میانه است که در شرق با ایندیانا و در غرب با رودخانه می سی سی پی هم مرز است. این منطقه که «ایالت پریری» نام دارد، با زمین‌های کشاورزی، جنگل‌ها، تپه‌ها و تالاب‌ها مشخص شده است. شیکاگو، یکی از بزرگترین شهرهای ایالات متحده، در شمال شرقی در سواحل دریاچه میشیگان قرار دارد. این شهر به خاطر آسمان خراش هایش مانند براق 1451 فوتی است. برج ویلیس و برج تریبون نئوگوتیک.",
                abr:"IL"
            }
            ,
            "MN":{
                id:41,
                name:"مینه‌سوتا",
                detail:"مینه سوتا ایالتی در غرب میانه ایالات متحده است که با کانادا و دریاچه سوپریور، بزرگترین دریاچه بزرگ، هم مرز است. این ایالت دارای بیش از 10000 دریاچه دیگر از جمله دریاچه Itasca، منبع اصلی رودخانه می سی سی پی است. «شهرهای دوقلو» مینیاپولیس و پایتخت ایالت سنت پل مملو از بناهای فرهنگی مانند موزه علوم مینه سوتا و مرکز هنر واکر، موزه هنر مدرن است.",
                abr:"VT"
            }
            ,
            "WI":{
                id:42,
                name:"ویسکانسین",
                detail:"ویسکانسین ایالتی در غرب میانه ایالات متحده با خطوط ساحلی در 2 دریاچه بزرگ (میشیگان و سوپریور) و فضای داخلی جنگل ها و مزارع است. میلواکی، بزرگترین شهر، به‌خاطر موزه عمومی میلواکی، با دهکده‌های بین‌المللی بازآفرینی‌شده متعدد، و موزه هارلی دیویدسون، که موتورسیکلت‌های کلاسیک را به نمایش می‌گذارد، شهرت دارد. چندین شرکت آبجو در میلواکی مستقر هستند و بسیاری از آنها تورهای آبجوسازی را ارائه می دهند",
                abr:"WI"
            }
            ,
            "MO":{
                id:43,
                name:"میزوری",
                detail:"میسوری ایالتی در منطقه غرب میانه ایالات متحده است. از نظر مساحت در رتبه 21 قرار دارد و با هشت ایالت همسایه است: آیووا در شمال، ایلینوی، کنتاکی و تنسی در شرق، آرکانزاس در جنوب و اوکلاهما، کانزاس و نبراسکا از غرب.",
                abr:"MO"
            }
            ,
            "AR":{
                id:44,
                name:"اکلاهما",
                detail:"اوکلاهاما ایالتی در منطقه مرکزی جنوبی ایالات متحده است که از جنوب و غرب با تگزاس، از شمال با کانزاس، از شمال شرقی با میسوری، از شرق با آرکانزاس، از غرب با نیومکزیکو و از شمال غربی با کلرادو همسایه است.",
                abr:"AR"
            }
            ,
            "OK":{
                id:45,
                name:"ورمونت",
                detail:"ورمونت ایالتی در شمال شرقی ایالات متحده است که به دلیل مناظر طبیعی خود که عمدتاً جنگلی است شناخته شده است. بخشی از منطقه نیوانگلند، همچنین به دلیل داشتن بیش از 100 پل چوبی سرپوشیده قرن نوزدهمی و به عنوان تولیدکننده عمده شربت افرا شناخته شده است. هزاران هکتار از زمین های کوهستانی توسط مسیرهای پیاده روی و پیست های اسکی عبور می کنند.",
                abr:"OK"
            }
            ,
            "LA":{
                id:46,
                name:"لوئیزیانا",
                detail:"لوئیزیانا یک ایالت جنوب شرقی ایالات متحده در خلیج مکزیک است. تاریخ آن به عنوان دیگ ذوب فرهنگ های فرانسوی، آفریقایی، آمریکایی و فرانسوی-کانادایی در فرهنگ های کریول و کاجون آن منعکس شده است. بزرگ‌ترین شهر، نیواورلئان، به‌خاطر محله فرانسوی دوران استعمار، جشنواره ماردی گراس، موسیقی جاز، کلیسای جامع سنت لوئیس به سبک رنسانس و نمایشگاه‌های زمان جنگ در موزه بزرگ ملی جنگ جهانی دوم شهرت دارد.",
                abr:"LA"
            }
            ,
            "VA":{
                id:47,
                name:"ویرجینیا",
                detail:"ویرجینیا، ایالتی در جنوب شرقی ایالات متحده، از خلیج چساپیک تا کوه‌های آپالاچی، با خط ساحلی طولانی اقیانوس اطلس امتداد دارد. این یکی از 13 مستعمره اصلی است، با بناهای تاریخی از جمله Monticello، مزرعه نمادین شارلوتسویل پدر موسس توماس جفرسون. شهرک جیمزتاون و استعمار ویلیامزبورگ موزه‌های تاریخی زنده هستند که زندگی دوران استعمار و انقلاب را بازسازی می‌کنند.",
                abr:"VA"
            }
            ,
            "KS":{
                id:48,
                name:"کانزاس",
                detail:"کانزاس ایالتی در غرب میانه ایالات متحده است. پایتخت آن توپکا و بزرگترین شهر آن ویچیتا است. کانزاس یک ایالت محصور در خشکی است که از شمال با نبراسکا هم مرز است. میسوری در شرق؛ اوکلاهما در جنوب؛ و کلرادو در غرب",
                abr:"KS"
            }
            ,
            "NM":{
                id:50,
                name:"نیومکزیکو",
                detail:"نیومکزیکو ایالتی در جنوب غربی ایالات متحده است. این یکی از ایالت های کوهستانی کوه های راکی جنوبی است که منطقه چهار گوشه غرب ایالات متحده را با یوتا، کلرادو به اشتراک می گذارد.",
                abr:"NM"
            }
            ,
            "WV":{
                id:51,
                name:"ویرجینیای غربی",
                detail:"ویرجینیای غربی یک ایالت شرقی ایالات متحده در کوه‌های پوشیده از درخت آپالاچی است. شهر هارپرز فری، جایی که رودخانه Shenandoah با رودخانه Potomac ملاقات می کند، محل حمله معروف دوران جنگ داخلی است. این شهر که توسط یک پارک تاریخی ملی احاطه شده است، مانند قرن نوزدهم به نظر می رسد و بسیاری از ساختمان ها به عنوان موزه های تاریخ زنده برای بازدید عموم باز هستند.",
                abr:"WV"
            }

        }
    }

    function changelang(id="") {
        if($("#lang").val() == "2" && $("#lang").val() == 2){
            $("html").attr("lang","fa-IR")
            $("#langform label").text("زبان خود را انتخاب کنید");
            $("#thetable thead tr th:first-child").text("ردیف");
            $("#thetable thead tr th:nth-child(2)").text("اختصار");
            $("#thetable thead tr th:nth-child(3)").text("اسم ایالت");
            $("#thetable thead tr th:nth-child(4)").text("توضیحات");
            if($("#thetable tbody tr td:nth-child(2)").text() != ""){
                var ids =$("#thetable tbody tr td:nth-child(2)").text();
                $("#thetable tbody tr td:first-child").text("1");
                $("#thetable tbody tr td:nth-child(2)").text(faobj.states[ids].abr);
                $("#thetable tbody tr td:nth-child(3)").text(faobj.states[ids].name);
                $("#thetable tbody tr td:nth-child(4)").text(faobj.states[ids].detail);
            }else{
                if(id !=""){
                var ids =id;
                    $("#thetable tbody tr td:first-child").text("1");
                    $("#thetable tbody tr td:nth-child(2)").text(faobj.states[ids].abr);
                    $("#thetable tbody tr td:nth-child(3)").text(faobj.states[ids].name);
                    $("#thetable tbody tr td:nth-child(4)").text(faobj.states[ids].detail);
                }
            }
            $("#thetable tfoot tr th:first-child").text("ردیف");
            $("#thetable tfoot tr th:nth-child(2)").text("اختصار");
            $("#thetable tfoot tr th:nth-child(3)").text("اسم ایالت");
            $("#thetable tfoot tr th:nth-child(4)").text("توضیحات");
        }else{
            $("html").attr("lang","EN");
            $("#langform label").text("Select Your Language");
            $("#thetable thead tr th:first-child").text("id");
            $("#thetable thead tr th:nth-child(2)").text("state name");
            $("#thetable thead tr th:nth-child(3)").text("details");
            // $("#thetable tbody tr td:first-child").text("1");
            // $("#thetable tbody tr td:nth-child(2)").text(obj.states[ids].name)
            // $("#thetable tbody tr td:nth-child(3)").text(obj.states[ids].detail)
            $("#thetable tfoot tr th:first-child").text("id");
            $("#thetable tfoot tr th:nth-child(2)").text("state name");
            $("#thetable tfoot tr th:nth-child(3)").text("details");
        }


        
    }
})